In [ ]:
import pandas as pd

In [53]:
# Sample data creation, Dataframe creation
datta = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Henry', 'Isabella', 'Jack',
             'Katherine', 'Liam', 'Mia', 'Noah', 'Olivia', 'Peter', 'Quinn', 'Rachel', 'Samuel', 'Taylor',
             'Uma', 'Victor', 'Wendy', 'Xavier', 'Yara', 'Zachary', 'Sophia', 'James', 'Luna', 'Ethan'],
    'Age': [60, 50, 27, 45, 32, 29, 38, 55, 24, 41, 
            33, 26, 31, 28, 35, 47, 22, 39, 52, 30, 
            36, 43, 25, 48, 23, 34, 31, 57, 20, 44],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami', 'Tokyo', 'Sydney', 'Berlin', 'Rome', 'Dubai',
             'Singapore', 'London', 'Manchester', 'Birmingham', 'Liverpool', 'Moscow', 'Vienna', 'Prague', 'Athens', 'Lisbon',
             'Cairo', 'Bangkok', 'Stockholm', 'Brussels', 'Oslo', 'Warsaw', 'Budapest', 'Dublin', 'Helsinki', 'Zurich'],
    'Country': ['USA', 'USA', 'USA', 'USA', 'USA', 'Japan', 'Australia', 'Germany', 'Italy', 'UAE',
                'Singapore', 'UK', 'UK', 'UK', 'UK', 'Russia', 'Austria', 'Czech Republic', 'Greece', 'Portugal',
                'Egypt', 'Thailand', 'Sweden', 'Belgium', 'Norway', 'Poland', 'Hungary', 'Ireland', 'Finland', 'Switzerland']
}

In [54]:
df = pd.DataFrame(datta) # DataFrame creation

In [51]:
print(df) # Display the DataFrame

      Name  Age         City   Country
0    Alice   60     New York       USA
1      Bob   50      Ontario    Canada
2  Charlie   27  Addis Ababa  Ethiopia

In [ ]:
df.head() # Display the first few rows of the DataFrame

In [ ]:
df.tail() # Display the last few rows of the DataFrame

In [ ]:
df.info() # Display summary information about the DataFrame

In [ ]:
df.describe() # Display statistical summary of numerical columns

In [ ]:
df.columns # Display column names

In [ ]:
df.index # Display index information

In [ ]:
df["country"] = df["Country"].str.lower() # Convert 'Country' column to lowercase and store in new 'country' column     
print(df) # Display the updated DataFrame

In [ ]:
df["Country"] # Access and display the 'Country' column

In [ ]:
df[["City", "Country"]] # Access and display multiple columns

In [32]:
len(df["Country"]) # Display the number of entries in the 'Country' column

3

In [ ]:
df.iloc[0] # Access the first row by index

In [ ]:
df.iloc[1][0]   # Access the first column of the second row

In [ ]:
df.iloc[1]["City"] # Access the 'City' column of the second row

In [ ]:
list(df.iloc[2]) # Access the third row and convert to list

In [ ]:
list(df.itertuples()) # Iterate over rows as namedtuples and convert to list

In [66]:
df[df["Country"] == "USA"] # Filter rows where 'Country' is 'USA'

      Name  Age         City Country
0    Alice   60     New York     USA
1      Bob   50  Los Angeles     USA
2  Charlie   27      Chicago     USA
3    David   45      Houston     USA
4     Emma   32        Miami     USA

In [ ]:
df[(df["Country"] == "USA") & (df["Age"] >= 45)] # Filter rows where 'Country' is 'USA' and 'Age' is 45 or older

In [67]:
df[(df["Country"] == "USA") | (df["Age"] < 30)] # Filter rows where 'Country' is 'USA' or 'Age' is less than 30

        Name  Age         City  Country
0      Alice   60     New York      USA
1        Bob   50  Los Angeles      USA
2    Charlie   27      Chicago      USA
3      David   45      Houston      USA
4       Emma   32        Miami      USA
5      Frank   29        Tokyo    Japan
8   Isabella   24         Rome    Italy
11      Liam   26       London       UK
13      Noah   28   Birmingham       UK
16     Quinn   22       Vienna  Austria
22     Wendy   25    Stockholm   Sweden
24      Yara   23         Oslo   Norway
28      Luna   20     Helsinki  Finland